Revit 2025 API
Revision.Create Method
 Creates a new Revision in the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static Revision Create(
	Document document
)
Public Shared Function Create (
	document As Document
) As Revision
public:
static Revision^ Create(
	Document^ document
)
static member Create :
        document : Document -> Revision
Parameters
document Document
 The document of the new Revision.
Return Value
Revision
 The newly created Revision.
Exceptions
Exception | Condition
ArgumentException |  document is not a project document.
ArgumentNullException |  A non-optional argument was null
Remarks
 The new Revision will be added at the end of the sequence of existing Revisions.
Example
private Revision AddNewRevision(Document document, string description, string issuedBy, string issuedTo, ElementId sequenceNumber, DateTime date)
{
    Revision newRevision = Revision.Create(document);
    newRevision.Description = description;
    newRevision.IssuedBy = issuedBy;
    newRevision.IssuedTo = issuedTo;
    newRevision.RevisionNumberingSequenceId = sequenceNumber;
    newRevision.RevisionDate = date.ToShortDateString();
    return newRevision;
}
Private Function AddNewRevision(document As Document, description As String, issuedBy As String, issuedTo As String, sequenceNumber As ElementId, [date] As DateTime) As Revision
    Dim newRevision As Revision = Revision.Create(document)
    newRevision.Description = description
    newRevision.IssuedBy = issuedBy
    newRevision.IssuedTo = issuedTo
    newRevision.RevisionNumberingSequenceId = sequenceNumber
    newRevision.RevisionDate = [date].ToShortDateString()
    Return newRevision
End Function
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
Revision Class
Autodesk.Revit.DB Namespace